Repository: eunhyekoo/glo_project
Catalog: feedback/TMData/[Naver] Boyfriend Makeover.tmx
Source language: ko_kr
Languages: en_us

source: 아아… 그럼…
en_us: o-oh... then...

source: 탈탈탈
en_us: SHAKE SHAKE SHAKE

source: 데, 데이트!?
en_us: a-a date?!

source: 나름 빡세게 했는데도 효과가 없는 거 같아서 휴식 중이야.
en_us: even though we followed it to a t, it didn’t work, so it’s on hold for now.

source: 촌스럽잖아~
en_us: my name was corny!

source: 적게 먹고,
en_us: ...ate very little...

source: 미쳤지, 미쳤어!!!
en_us: I must have lost it for a bit!!!

source: 대신 너한테...
en_us: so...

source: 점프
en_us: JUMP

source: 어우 씨X 이제야 분이 풀리네.
en_us: finally! all my anger’s let out!

source: 아 맞다, 미미쨩 너 윤시아랑 좀 아는 사이냐?
en_us: oh, right. mimi-chan. you close to sia at all?

source: 너 윤시아 잉스타 안 봤냐?
en_us: didn’t you see sia’s instargram profile?

source: 어디 가는 거야?
en_us: where are you going?

source: 석기 풍물시장 건욱 사거리
en_us: Seokgi Market Geonuk Intersection

source: 찾아버렸다!!!
en_us: I found her!!!

source: 조회수 25만회 2주 전
en_us: 250k views 2 weeks ago

source: 헤헤, 이제 집 가서 단풍 앤 파이터 일일 퀘스트 할 거야!!
en_us: hehe, I’m going to go home and do the daily quest on maple and fighter!!!

source: 익숙한 교복 차림들,
en_us: I wear the same uniform...

source: 에휴
en_us: SIGH

source: 사람들이 손가락질을 할 것만 같다.
en_us: people will also point fingers at me...

source: 프로젝트 마지막 날까지도 20일이 남았고,
en_us: ...and only 20 days remained until the last day of the project.

source: 인기 급상승 동영상 1등을 차지하게 되었고,
en_us: ...became the top trending video.

source: 루틴 시작한지 3주 만에 이정도라니 대단하네~
en_us: these are amazing results! you’ve only been following the routine for three weeks.

source: 나 진짜 어떡해...!!!
en_us: what should I do?!!!

source: 관리하지 않는 남자만 있을 뿐.
en_us: there are only men who don’t take care of themselves.

source: 뭐야, 이 쬐그만 건?
en_us: what’s with this little girl here?

source: 파바박
en_us: POP POP POP

source: 딱 보고 관리하면 잘 생겨질 줄 알았다고!
en_us: I knew he’d look great if he just worked out and managed his weight!

source: 날 굳이 이런 곳까지 데려온 이유가 있어?
en_us: was it even necessary to come all the way here?

source: 성환이가 한 몫 했구나?
en_us: so, seonghwan played a big role, huh?

source: 너무해, 시아쨩!!
en_us: that’s mean, sia-chan!!!

source: 어쩐지 영상보니까 백시원 표정이 안 좋은게 식은 거 같긴 했어~
en_us: no wonder siwon’s expression didn’t look so good in their recent videos.

source: 이씨!!!
en_us: shut up!!!

source: 그, 그치만...!!
en_us: b-but...!!!

source: 나 죽는다아~!!!
en_us: I’m dying!!!

source: 나 윤시아.
en_us: I, sia yoon...

source: 김민호 그 놈이 그렇게 새침떨 줄은 몰랐다니까!?
en_us: who knew minho would back away like that?!

source: O형일걸?
en_us: but she’s probably an o-type.

source: 큰 돈을 벌 거야…
en_us: ...make it big.

source: 정말 네가 달라진 게 없다고 생각해?
en_us: do you really think nothing has changed?

source: 계좌이체 진안은행
en_us: Electronic Deposit Jin An Bank

source: 질러 질러 노래방
en_us: BELT-OUT-A-TUNE KARAOKE

source: 햄버거?
en_us: a burger?

source: 이렇게 사랑하는데...
en_us: I love her so much...

source: 오늘 우리…
en_us: this is...

source: 쿠당탕!
en_us: TUMBLE

source: 아니, 그게 아니고...
en_us: no, I mean...

source: 슬슬 밥 먹긴 해야겠다.
en_us: yeah, we should eat something.

source: 나코땅 기특해~!!!
en_us: nako-chan! I’m so proud of youuu!!!

source: 내가...?
en_us: m-me?

source: 음성제거 점수제거 1절연주
en_us: Remove melody Remove scores 1st verse only

source: 네 말이라면 전부 따를게!
en_us: I promise!

source: 90kg
en_us: 198 lbs

source: 정답은 간단해~
en_us: the answer is simple.

source: 당연히 한 방에 OK해야하는 거 아니야?
en_us: so he should have said yes right away!

source: 또 맞고만 있었어...
en_us: I couldn’t fight back...

source: 댓글 3451개
en_us: 3451 Comments

source: 대체 뭘 기대한 거야, 난!!!
en_us: why did I even get my hopes up?!

source: 김민호 걔가 몰래 굶고 운동하다 쓰러졌었다고…?
en_us: ...minho secretly starved himself and blacked out while exercising?

source: 흐억
en_us: GASP

source: 으음, 흥미롭긴 하지만...
en_us: um, it does sound interesting...

source: 저게 뭔 소리야!
en_us: what’s she talking about?!

source: 야, 어제 뉴튜브 뜬 거 봤냐?
en_us: hey, did you see the new vid on newtube?

source: 쇼핑이 이렇게 힘든 거였다니…
en_us: was shopping always this difficult?

source: 역시 멋있어!!
en_us: you’re so cool!!!

source: 꿀 꿀홍삼 시원오빠는요??
en_us: H Honeybunny where’s siwon??

source: 울 아빠랑 삼촌은 파티광이거든…
en_us: my dad and uncle are party animals...

source: 시끄럽게 하길래 혼 좀 내줬지!
en_us: they were being noisy, so I taught them a lesson!

source: 괜찮겠어?
en_us: will that be okay?

source: 나랑 알고리즘 겹치네ㅋㅋ
en_us: our algorithms must be similar, lol.

source: 펄럭...
en_us: FLAP

source: 내가 원인을 찾아내고 말 거야...!!
en_us: I’m going to figure it out, no matter what it takes!!!

source: 굶어야 해!!!
en_us: I shouldn’t eat!!!

source: 아, 안 되는데...
en_us: I-I can’t...

source: 절대 쉽게는 안 해주겠지.
en_us: you wouldn’t say “yes” so easily.

source: 여, 영화?
en_us: th-the movie?

source: 아, 아니야...
en_us: n-never mind...

source: 자, 이제 네 차례네!
en_us: then, it’s your turn now!

source: 탁탁탁
en_us: STEP STEP STEP

source: 인싸들의 전유물인...
en_us: I’ll have to follow the in-crowd...

source: 알렉스
en_us: Alex

source: 이리 내놔!
en_us: hand it over!

source: 조, 조건...?
en_us: a-a c-condition?

source: 헐~
en_us: huh?

source: 정말~!?
en_us: reeeally?!

source: 와~ 김민호 왔대, 대박!!
en_us: whoa! it’s minho kim! amazing!!!

source: ASMR 뉴튜버는 어때...?
en_us: an ASMR video!

source: 무엇보다도 매일 화장실을 갈 수 있게 됐어!
en_us: and most important! I can go number two every day now!

source: 네, 네가 왜 여길...!
en_us: wh-why... why are you here?!

source: 그래, 하자.
en_us: sure. let’s do it.

source: 상처받았나보네~
en_us: your feelings must have been hurt.

source: 대한민국 NO1
en_us: Korea’s Best

source: 꽃분아!!
en_us: daisy!!!

source: 이대로 쭉 롱런해서 100만 뉴튜버까지 가는 거야!!
en_us: I’ll keep running this marathon and make it to a million subscribers!!!

source: 우와, 그새 키도 컸잖아…?
en_us: wow, and he grew taller too!

source: 내가 왜 라면을...
en_us: why am I making noodles...?

source: 민호의 이번 체중 감량은
en_us: the weight minho lost...

source: 물론 뭐든 그 유광패딩보다 낫겠지만…
en_us: well, I guess anything would be better than that shiny down jacket...

source: 당근이지~ 요즘 매일 가잖아.
en_us: of course! I’ve been going out every morning recently.

source: 20만명
en_us: 200k subscribers

source: 12화
en_us: Episode 12

source: 더 울려라~
en_us: keep growling...

source: 참나, 자기들은 취미생활 없어?
en_us: gosh, don’t they have hobbies of their own?

source: 라면을 먹을 때도 그 아이 생각이 나고...
en_us: she comes to mind whenever I eat instant noodles...

source: 꾸오오오
en_us: SQUEEOO

source: 이게…
en_us: what the hell...

source: 프로젝트 하는 동안 네 뉴튜브에도 김민호 출연할 수 있게 해줄게!
en_us: so I’ll let minho appear on your channel during the project!

source: 그냥 인플루언서로 썩긴 아깝긴 했어.
en_us: ...it would have been a shame to let siwon baek...

source: 오빠, 미안...
en_us: sorry, minho...

source: 역시 나에겐 성환쨩밖에 없다구~!!!
en_us: you’re the only one who’s there for me, seonghwan-chan!!!

source: 미소녀 연애 시뮬레이션 게임 경력 6년차인 나의 작전이라면 성공할 수 있을거야!!
en_us: I have six years of experience playing a game about dating beautiful girls! I’m sure my plan will work!!!

source: 아이시아우우~~
en_us: aishiawuu~~

source: 흐아아
en_us: ACK

source: 난 그냥 오타쿠랑은 다르니까~
en_us: I’m different from normal geeks.

source: 예상한 것 만큼이나 처참한 광경이군...
en_us: I expected it... but this is pathetic...

source: 7천
en_us: 8.7K

source: 너무 힘들어서 하고 싶어도 못 하는 것 같다...
en_us: I think he wants to... but he’s too tired to do so.

source: 오랜만에 노래방이나 가볼까…
en_us: maybe I’ll just go karaoke...

source: 어, 없네...?
en_us: he isn’t here...

source: 튼튼이치과 2F
en_us: Good Dentist 2F

source: 두근 두근, 넘 떨린당~!!!
en_us: I’m so excited I can hear my heartbeat!!!

source: 우리 민호 꿈도 참 크네~
en_us: you’re getting way ahead of yourself, minho!

source: 어!?
en_us: huh?!

source: 좀 티나?
en_us: you can tell?

source: @rang.toon 글 랑쓰
en_us: @rang.toon Story rangs

source: 내남친 킹카만들기
en_us: My Dud to Stud Boyfriend

source: 너 나오는 뉴튜브 잘 보고 있어.
en_us: I’ve been watching the newtube videos you’re in.

source: ㅇㅂㅇ 아 맞다 요즘 넘 바빠서…ㅠ 잊고 있었네
en_us: O.O I forgot! I’ve been so busy lately... :’(

source: 김민
en_us: Minha Kim

source: 원 투 쓰리 포~
en_us: one two three four~

source: 부끄러워하지말고 데이트 비용 부족하면 말 해, 용돈 지원해줄테니!
en_us: come on, don’t be shy! if you ever need money for your dates, just ask, okay?

source: 시아님 혹시 시원오빠랑 싸웠어요??
en_us: sia! did you have an argument with siwon??

source: 다른 애들이 보며 어떡하려고!!
en_us: what if the other kids see?!

source: 맛있겠다…
en_us: sounds delicious...

source: 도대체 이게 몇 곡 째야!!
en_us: how many songs have they sung already?!

source: 프로젝트 성공하기로.
en_us: to make sure this project succeeds.

source: 만식이는...
en_us: mansik is...

source: 풉
en_us: PFFT

source: 허리가 쭉 펴져 있어야 한다구!
en_us: straighten your back!

source: 이, 이게 뭔데…!
en_us: wh-what the heck is this?!

source: 자아, 여러분!
en_us: everyone!

source: 뷰티 뉴튜버 알렉스!
en_us: the beauty newtuber, alex!

source: 다라 고등학교 구독자 수 상위 1%
en_us: newtuber sia yoon.

source: 예원
en_us: Yewon

source: 히잉...
en_us: awww...

source: 연예인이라도 왔나?
en_us: is that a celebrity or something?

source: 헤헷
en_us: HEHE

source: 생각할 시간도 줄게!
en_us: think it over for a bit!

source: 민호는…
en_us: minho...

source: 난 정말 괜찮아…
en_us: I’m really okay...

source: 어제 시아와 찍었던 뉴튜브 스트리밍이 화제가 되어,
en_us: yesterday’s newtube livestream with sia...

source: 그런데 너...{j}이때는 좀 더 마르고 키도 작았네?
en_us: you were pretty skinny and short back then, too.{j}

source: 난 진짜 노답이야...
en_us: I’m totally useless...

source: 잠깐...
en_us: wait...

source: 윤시아 정말 좋은 녀석이더라.
en_us: sia seemed like a good kid.

source: 시아 친구도 스타일이 정말 좋은 것 같아...
en_us: sia’s friend is really fit and stylish...

source: 소화전
en_us: FIRE EXTINGUISHER

source: 제발 시아쨩!!
en_us: please, sia-chan!!!

source: 으음, 그러니까...
en_us: hmm, so...

source: 그날 이후 김민호는...
en_us: starting that day, minho...

source: 가자, 랑부기!
en_us: let’s go, tortle!

source: 영앤 리치라니...
en_us: young and rich, too!

source: 응, 원래 친구집에서 앨범 구경하고 놀면 재밌잖아.
en_us: yeah. it’s really fun looking at friends’ picture albums.

source: 이 헬스장을 운영하고 있는 현호형이야.
en_us: this is hyeonho. he owns this gym,

source: 아아- 이번 극장판 정말 어마어마했지!
en_us: ahhh! the movie was incredible, wasn’t it?

source: 치킨의 진수
en_us: Fried Chicken

source: 버블 스타!!
en_us: bubble star!!!

source: 21화
en_us: Episode 21

source: 그나저나 구독자 수 진짜 어떡하냐...
en_us: at any rate... what should I do about my subscribers?

source: 시원이랑 오랜만에 에버랜드 다녀왔어요
en_us: Siwon and I visited an amusement park for the first time in a while! :)

source: 어떻게긴~
en_us: how?

source: 음…
en_us: hm...

source: 그게…
en_us: well...

source: 김민호~ 운동가자~
en_us: minho! let’s go work out!

source: 나의 환상은 하루만에 깨져버렸지만...
en_us: my fantasies shattered that day...

source: 오늘은 매점 줄 별로 안 길다!
en_us: the line at the store isn’t too long today!

source: 시아는 정말 좋은 애야!
en_us: sia’s a really good person!

source: 난 항상 그대론데...
en_us: ...but I’ve always been the same.

source: 그렇게 적게 먹었는데 배가 불러?
en_us: you’re full? but you barely ate anything!

source: 윤시아의 비공개 계정에는...
en_us: sia yoon uses her private account...

source: <옐랑말랑 타투 립 2호>
en_us: Yellang Lip Tint #2

source: 그럼 우리 뉴튜브 채널은 어떡해?
en_us: then what about our newtube channel?

source: 그러니까 네 말은...
en_us: so you’re saying...

source: 재밌냐 오덕아?
en_us: having fun, geek?

source: 부끄럽게…
en_us: I’m a bit embarrassed...

source: 평생 굶고 살 것도 아니잖아!
en_us: it’s not like you’re going to live your whole life without eating!

source: 4화
en_us: Episode 4

source: 고기 한 점에 야채 듬뿍 싸서 먹어야 해.
en_us: eat a bunch of veggies with every piece of meat.

source: 오, 웬일?
en_us: oh, what’s gotten into you?

source: 단기간 다이어트
en_us: lose weight fast

source: 살이 왜 이렇게 많이 빠진 거야!!
en_us: why did you lose so much weight?!

source: 순진했던 중학교 2학년 때부터 만나,
en_us: ...was my boyfriend since my innocent middle school years.

source: 얘 지금 나랑 해보자는 거야!?
en_us: seriously?!

source: 아무리 그래도 갑자기 이렇게 많이 먹어도 돼…?
en_us: is it really okay to eat so much all of a sudden?

source: 나 잘 하고 있었구나...
en_us: that’s a relief...

source: 왜 갑자기 다시 쓰는 건데;
en_us: why are you suddenly using that tone again?

source: 나도 얼마 전에 구독했었는데!
en_us: I subscribed to them recently!

source: 뭐, 뭐지...
en_us: wh-what is this?

source: 시아야아아아!!
en_us: siaaaa!!!

source: 맞아...!
en_us: that’s right!

source: 우리는 어딜가나 항상 붙어있었고,
en_us: we played together all the time.

source: 더, 더는 안 돼...
en_us: I-I... can’t do... anymore...

source: 엄청 진지한 맘으로 임해주고 있었구나!!
en_us: you took this really seriously, didn’t you!!!

source: 타로
en_us: Tarot

source: 황금붕어빵
en_us: Golden Bungeo-ppang

source: 양꼬치
en_us: Lamb Skewers

source: 이번에 너희 둘이 찍은 사진 잘 나왔더라.
en_us: the picture you two took recently came out really nicely.

source: 시아와세노소라~
en_us: shiawasenosora~

source: 너무아쉽다~
en_us: what a shame!

source: 저기 봐!
en_us: look!

source: 끔찍해…!
en_us: that’s dreadful!

source: 넌 왜 갑자기 시비야!?
en_us: are you picking a fight?!

source: 체지방량 kg
en_us: Body Fat lbs

source: 추천 이기어플 카테고리
en_us: Recommended Trending Categories

source: 콘시리얼 막심
en_us: CEREAL Instant Coffee

source: 체중 kg
en_us: Weight lbs

source: 그 시각 민호는...
en_us: meanwhile, minho...

source: 스윽…
en_us: WOW

source: 난 시아쨩한테 어울리는 남자가 되고 싶으니까!
en_us: I want to be someone who deserves to be by your side!

source: 돼…
en_us: a...

source: 그것도…
en_us: and...

source: 들었냐 미미쨩?
en_us: you heard that, mimi-chan?

source: 게임뉴튜버...!?
en_us: how about a gaming vid?

source: 처억
en_us: TAP

source: 시아쨩~!
en_us: sia-chan!

source: 윤시아?
en_us: sia?

source: 구독자 수 46.7만
en_us: subscribers 467k

source: 이제 알겠다.
en_us: I think I now know...

source: 자신 없었어.
en_us: about this project.

source: 요즘따라 시원이가 조금 쌀쌀 맞아지긴 했지만...
en_us: siwon has been a bit cold recently...

source: 지금의 내가 너무 싫어!!!
en_us: I hate the way I am now!!!

source: 헉!!
en_us: ack!!!

source: 째로 우리랑 놀아!
en_us: skip it and play with us!

source: 그치, 시원아?
en_us: what do you think, siwon?

source: 김민호.
en_us: minho.

source: 한 달만 이렇게 유지하고 이후엔 느슨하게 해줄게, 좀만 참자!
en_us: let’s keep this pace for just a month. we’ll take it down a notch after that, so hang in there!

source: 그때 그 닭가슴살 빌런...!!??
en_us: isn’t he the chicken breast villain?!!!

source: 먹을래?
en_us: want this?

source: 지금 정신이 없어서...
en_us: I’ve been so out of it.

source: 톡톡
en_us: TAP TAP

source: 깨작…
en_us: SIGH

source: 그렇지 민호킁...!?
en_us: right, minho-kun??

source: 정말!?!?!?
en_us: really?!!!

source: 지금부터 시작합니다!
en_us: ...begins!

source: 김민호의 옷장 검사를 해볼까나...
en_us: how does minho’s closet look?

source: 잘 하고 있으니까!
en_us: you’re doing really well!

source: 그냥 크리스마스 선물이라고 생각해~
en_us: just think of this as my christmas gift to you!

source: 새해가 밝았고,
en_us: the new year started...

source: 식단 빡세게 하고 있는데..ㅎㅎ
en_us: I’m following a really strict meal plan... hehe.

source: 존잘...
en_us: handsome...

source: 그러니까…
en_us: so...

source: 시아쨩이 준 옷들 다 입고 나오면 되는 거야…?
en_us: so... I just need to wear everything you picked out for me... right?

source: 이번에만 살 빼고 말 사람처럼 하지 말고,
en_us: instead of dieting as if he’ll only lose weight now and never again...

source: 나 기억하지?
en_us: you remember me, right?

source: 왜 이렇게 역변해버린 거냐고!!!
en_us: ...so how did he end up like this?!!!

source: 석 두근두근..!
en_us: S *drumroll*

source: 훼북에서 <7세 태권도 신동녀 근황> 게시물로 떡상한 그 잉스타 스타 아냐!?
en_us: that instargram star in that viral post, “7-year-old taekwondo prodigy today”!!!

source: 설명하자면 긴데...
en_us: it’s a long story...

source: 꿀밤 먹일까…
en_us: maybe he needs a knuckle sandwich

source: 나 찐팬인데 요(즘) 눈빛이라고 해야하나.., 뭔가 쎄했음
en_us: I really liked them, but something about his eyes just didn’t seem so warm.

source: 괜찮은 거 같네.
en_us: sounds pretty good.

source: 나의 공격을 받아랏!!!
en_us: take this!!!

source: 후후후
en_us: HEHEHE

source: 노트북 좀 빌린다.
en_us: I’m gonna borrow your laptop.

source: 응원한다 키미노쿤!
en_us: I’m rooting for you, minho-kun!!!

source: 야, 건들지마, 쟤 빡치면 개 무섭잖아…
en_us: hey, stop. she’s really scary when she gets mad...

source: 드디어 겨울 방학이 시작되었다.
en_us: ...marking the start of winter vacation.

source: 이날만을 기다렸다구!!
en_us: I’ve been waiting forever for this day!!!

source: 저번에 전민국 매점에서 발차지 맞고 이빨 털렸던 거 기억 안 나?
en_us: remember? minguk jeon lost a few teeth after she kicked him that day at the store...

source: 시험기간 브이로그 조회수 잘 나온단 말야.
en_us: besides, midterm vlogs get tons of views.

source: 날씨도 좋은데… 셀카나 찍을까?
en_us: the weather’s really nice... how about taking a selfie?

source: 숨 참고 트웰브~
en_us: take a breath and twelve~

source: 아이 참~
en_us: wait for me!

source: 민호님!
en_us: minho!

source: 너무 늦었다~
en_us: you’re late!

source: 꼬...{j}꽃분...
en_us: d-daisy...{j}

source: 주말 아침 동네에는,
en_us: ...but there are a lot of people...

source: 2주 후…
en_us: two weeks later...

source: 내가 고쳐줄 수 있는 것들인지 확인해볼거야.
en_us: I have to know whether I’m capable of helping you change them.

source: 만식이가 머리는 건들지 말라고 하더라구, 나중에 어떤 헤어스타일링은 할지 모르니까…
en_us: but mansik told me not to do anything with my hair, because we don’t know how we’ll style it later...

source: 이후 양치와 세안을 하고
en_us: then, she brushes her teeth, washes her face...

source: 시아야!
en_us: sia!

source: 보글 보글
en_us: BOIL BOIL

source: 정말 쉽지 않은 거구나…
en_us: ...isn’t easy, is it?

source: 반응 좋네~
en_us: the responses are good.

source: 뽀각!
en_us: CRACK

source: 아오 지겨워
en_us: ughhh

source: 첫 번째, 하루 세끼 챙겨먹기.
en_us: first rule, eat three meals a day.

source: 오타쿠도 사랑을 할 수 있다!!!
en_us: otakus are capable of loving, too!!!

source: 오랜만이다…
en_us: it’s been so long...

source: 중학교에 갓 입학했을 때…
en_us: not long after I started middle school...

source: 새로운 뉴튜브 콘텐츠의 주인공이 되어 달라구...?
en_us: you want me to be the subject of your new newtube video series?

source: 하이~
en_us: hi!

source: 헐 너무 충격이다ㅜㅜㅜ 매일 밥먹을 때마(다) 틀어놓던 뉴튜버였는데...
en_us: omg this is so shocking :( :( :( I always watched their videos while eating...

source: 윤시아라고 부르라니까!!!
en_us: my name’s sia now!!!

source: 나도 너처럼 뉴튜브나 시작해볼까나~
en_us: maybe I should start a newtube channel like you.

source: 나, 난 몰라!
en_us: I-I don’t know!

source: 지금 민호 정도면 설레냐구!
en_us: does minho’s face make you nervous now?

source: 도로 가져가요...
en_us: take him back...

source: 뭐야, 해주고 싶다던 선물이 귀도리였어?
en_us: you wanted to buy me ear warmers?

source: 그래서 내가 계획한 다이어트 방법은...
en_us: the diet I came up with...

source: 시, 시아쨩이…?
en_us: w-with... sia-chan?

source: 삐쭉
en_us: POUT

source: 뭐 하루이틀이냐~
en_us: whatever. it’s nothing new.

source: 그, 그만!
en_us: w-wait!

source: 김민호입니다만!!!
en_us: I’m minho kim!!!

source: 잘생겨지고 싶지 않아?
en_us: don’t you want to be handsome?

source: 이번 방학도 아주 바빠질 거야!
en_us: we’ll be very busy this vacation!

source: 몸도 그렇고, 목소리도…
en_us: his body and voice...

source: 그렇게 부담스럽진 않잖아?
en_us: so it’s really light on the stomach!

source: 개이득...!
en_us: it’s a super good deal!

source: 나..
en_us: I...

source: 게다가 그 전남친은 엄청난 미남에 인기남이었어.
en_us: to make matters worse, that ex was really handsome and popular.

source: 오랜만에 민호가 즐거워하는 모습을 보니까
en_us: at least it looks like minho’s really enjoying himself.

source: 룰루랄라
en_us: HO~ HUM~

source: 조회수 12.4만회 3개월 전 120명 1.4만명
en_us: 124K views 3 months ago 120 Likes 1.4 Dislikes

source: 남들처럼 예쁜 잠옷을 입고 브이로그도 찍을 수 없고,
en_us: I can’t make vlogs in cute pajamas like everyone else.

source: 뭐야!
en_us: what the-!

source: ㅎㅎ땡큐
en_us: haha, thanks.

source: 이거 서열 정리 한 번 해줘야겠구만!?
en_us: I need to teach you a lesson!!

source: 쾅!
en_us: SLAM

source: 뭐, 이름이야 개명하면 되니까 그리 놀라운 일은 아니지.
en_us: she could have changed her name. that’s not a big deal.

source: 시원아!
en_us: siwon!

source: 엄청 수척해졌는데...
en_us: ...but he looks like he lost something else.

source: 이름이 달라서...
en_us: ...your name was different.

source: 헐!!
en_us: whoa!!!

source: 네에~
en_us: yes, teacher!

source: 그런가?
en_us: is it?

source: 번뜩!
en_us: PING

source: 그, 그럼 크리스마스 선물은…
en_us: th-then... what about the christmas present?

source: 그럼 한 입만...
en_us: then... just one bite...

source: 그 이후로도…
en_us: afterward...

source: 시시커플 계정은 앞으로 저의 개인 뉴튜브 계정으로 사용하기로 결정했으며, 여태 시시커플을 사랑해주셨던 분들께
en_us: The SISI Couple channel will now be my personal channel. I want to extend my deepest apologies for disappointing those of you who have

source: 전노래연습장
en_us: oin Karaoke

source: 연예인 다이어트
en_us: celebrity diets

source: 그냥 포기해라...
en_us: just forget her...

source: 30분 후!
en_us: 30 minutes later!

source: 근데 어떡하냐, 나 얘랑 만난지 얼마 안 돼서 같이 저녁먹고 들어갈 것 같은데.
en_us: besides, it hasn’t been long since I met up with him, so I’m probably eating out for dinner.

source: 넌 잘 하고 있으니까.
en_us: you’re doing a great job.

source: 그림 섯끼
en_us: Illustrations sutggi

source: 너 다이어트 같은 거 해본 적도 없으면서...
en_us: you know nothing about dieting...

source: 그, 글쎄…
en_us: I-I’m not sure...

source: 너무 배가 고파서 말인데...
en_us: really hungry right now...

source: 후루룩
en_us: SLURP

source: 아침 9시
en_us: at 9:00 am...

source: 엔프피인가?
en_us: is she an enfp?

source: 메이크업, 헬스, 일상 등 다양한 콘텐츠를 다루며
en_us: he uploads a variety of content like makeup, fitness, and lifestyle routines.

source: 네!?
en_us: what?!

source: 헌혈
en_us: Blood

source: 시아쨩!?
en_us: sia-chan?!

source: 잠을 자도 그 아이 생각이 나...!
en_us: ...and even while I’m sleeping!

source: 여긴 너랑 나의 추억이 쌓인 특별한 장소였는데...
en_us: this was a special place full of memories between you and me.

source: 흥!
en_us: HMPH

source: 질끈
en_us: ERGH

source: 시간은 얼마 남지 않았는데…
en_us: we don’t have a lot of time left...

source: 이 치욕은 절대 잊을 수 없어!!!
en_us: I can’t let this humiliation slide, ever!!!

source: 겨울방학을 기념해서 성환쿤이랑 게임을 시작했어~ 이름하여 단풍 앤 파이터라고...
en_us: I started a game today with seonghwan-kun since it’s winter vacation! it’s called maple and fighter...

source: 뭐하는 녀석이야!?
en_us: who the heck is he?!

source: 자아, 그럼 개봉박두입니다!!
en_us: lunch is ready! here it is!!!

source: 삐삐삐삑
en_us: BEEP BEEP BEEP BEEP

source: 으음
en_us: UHM

source: 모니터 밖의 여자를 좋아하게 된 겁니다만...?
en_us: I like a girl that lives outside of the monitor...

source: 내가 뭐!?
en_us: what did I do wrong?!

source: 말하자면 메이크 오버 콘텐츠인 거지.
en_us: basically, it’s a makeover series.

source: 다들 민호가 잘 적응할 수 있도록 잘 도와주고, 친하게 지내봐요~!
en_us: I hope all of you will help him feel comfortable here. be nice to him!

source: 연습장
en_us: KARAOKE

source: 로데오거리
en_us: Rodeo Street

source: 한겨울에 천 원 한 장 없이 돌아다녔다니!
en_us: I walked around in the cold winter without a single dollar bill in my pocket!

source: 길다면 길었던 1학년 학교 생활이 끝나고,
en_us: and so, the first year of high school finally came to an end...

source: 뭐야, 그런 것도 안 정해뒀어?
en_us: what? you didn’t think that through?

source: 라고 생각은 했는데…
en_us: ...is what I thought.

source: 신선하고~
en_us: a novel experience.

source: 홍성선
en_us: Seongsun Hong

source: 93kg…
en_us: 205 pounds...

source: 다행히도 민호 체력이 예전보다 많이 좋아져서
en_us: fortunately, minho’s a lot stronger than before.

source: 내, 내가...?
en_us: m-me? I... changed?

source: 상대할 가치도 없어.
en_us: you’re not worth my time or energy.

source: 허, 허헉…!!
en_us: e-eep!!!

source: 자, 앞으로 30번 더!!
en_us: okay! 30 more, just like this!

source: 큰일났다!!!
en_us: I’m in trouble!!!

source: 앗!
en_us: oh!

source: 어휴…일단 따라와!
en_us: ugh... follow me!

source: 이게 뭐야!
en_us: wh-what’s this?!

source: 뭐, 뭐뭐뭐뭐뭐야!
en_us: wh-wh-wh-wh-what?!

source: 어머~ 안쓰러워라!
en_us: oh, no! you poor thing!

source: 어딜 봐서 내가 얘랑 사귀어!!
en_us: why would I ever date him?!

source: 로데오
en_us: Rodeo

source: 그게 나야...
en_us: that’s me...

source: 우와, 진짜요!?
en_us: wow, really?!

source: 애가 막 날아다니는거 개쩔었는데
en_us: it was so cool seeing her kick around in the air back then

source: 당연한 걸...!!
en_us: of course!

source: 푸핫!!!
en_us: PUAHAHA!!!

source: 시시커플TV
en_us: SISI Couple TV

source: 고작 며칠만에 3kg가 빠지다니!!!
en_us: I lost seven pounds in just a few days!!!

source: 오타쿠 새X 뉴튜브 찍는다고 나대네ㅋㅋ
en_us: that otaku loser? on newtube? pffft!

source: 강약약강의 교과서라고나 할까...
en_us: they act strong in front of weaker kids, but are weak in front of stronger ones.

source: 붕어빵 쯤은 괜찮지 않을까…!!!
en_us: a couple bungeo-ppangs shouldn’t hurt!!!

source: 미친 개 열심히 부르네ㅋㅋㅋ
en_us: oh, gosh. he’s really singing his little heart out.

source: 아, 좀 하라면 그냥 해!
en_us: ugh, just do as I say!

source: 다행이다.
en_us: whew,

source: 변비 탈출이라고!
en_us: no more constipation!

source: 덕질하느라 늦게 자서 매번 야식 먹고 수면부족에,
en_us: he stans his anime characters until late at night while eating snacks instead of sleeping.

source: 으으 추워…
en_us: BRR it’s cold...

source: 새 채널을 파서라도 할 거야!
en_us: I’ll create a new channel if I have to!

source: 노래방 룰…?
en_us: karaoke rules?

source: 저기, 민호킁.
en_us: you know, minho-kun...

source: 얼레리 꼴레리~
en_us: teehee

source: 기다렸지?
en_us: sorry to keep you waiting!

source: 다 처음 듣는 노래인데다가…
en_us: I’ve never heard any of these songs before...
